R code to reproduce table, figures, and software output. The directory
=Batch= contains files used to run the simulation studies on a
HPC. Results are stored in the directory =results= as intermediate
results that can be used to re-generate related figures. All other
results should be reproducible on a standard laptop with the following
configuration:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
source("mainInference.R")
source("mainSoftware.R")
sessionInfo()
#+END_SRC

#+RESULTS:
#+begin_example
data.table 1.14.2 using 8 threads (see ?getDTthreads).  Latest news: r-datatable.com
Loading required package: Rcpp
BuyseTest version 3.0.1
R version 4.2.0 (2022-04-22)
Platform: x86_64-pc-linux-gnu (64-bit)
Running under: Ubuntu 20.04.4 LTS

Matrix products: default
BLAS:   /usr/lib/x86_64-linux-gnu/blas/libblas.so.3.9.0
LAPACK: /usr/lib/x86_64-linux-gnu/lapack/liblapack.so.3.9.0

locale:
 [1] LC_CTYPE=en_US.UTF-8       LC_NUMERIC=C              
 [3] LC_TIME=en_US.UTF-8        LC_COLLATE=en_US.UTF-8    
 [5] LC_MONETARY=en_US.UTF-8    LC_MESSAGES=en_US.UTF-8   
 [7] LC_PAPER=en_US.UTF-8       LC_NAME=C                 
 [9] LC_ADDRESS=C               LC_TELEPHONE=C            
[11] LC_MEASUREMENT=en_US.UTF-8 LC_IDENTIFICATION=C       

attached base packages:
[1] stats     graphics  grDevices utils     datasets  methods   base     

other attached packages:
[1] BuyseTest_3.0.1   Rcpp_1.0.9        ggplot2_3.4.3     data.table_1.14.2

loaded via a namespace (and not attached):
 [1] pillar_1.9.0        compiler_4.2.0      tools_4.2.0        
 [4] digest_0.6.33       lattice_0.20-45     lifecycle_1.0.3    
 [7] tibble_3.2.1        gtable_0.3.4        pkgconfig_2.0.3    
[10] rlang_1.1.1         Matrix_1.6-1.1      DBI_1.1.3          
[13] cli_3.6.1           parallel_4.2.0      SparseM_1.81       
[16] prodlim_2019.11.13  withr_2.5.1         dplyr_1.0.10       
[19] MatrixModels_0.5-0  generics_0.1.3      vctrs_0.6.3        
[22] globals_0.16.2      stats4_4.2.0        grid_4.2.0         
[25] tidyselect_1.2.0    glue_1.6.2          listenv_0.9.0      
[28] R6_2.5.1            future.apply_1.11.0 fansi_1.0.4        
[31] parallelly_1.36.0   survival_3.5-0      lava_1.7.2.1       
[34] magrittr_2.0.3      splines_4.2.0       scales_1.2.1       
[37] codetools_0.2-18    assertthat_0.2.1    future_1.33.0      
[40] colorspace_2.1-0    utf8_1.2.3          munsell_0.5.0
#+end_example
